benchmarks/results/largebody_20260725_020231/nginx_large_gzip_c20.txt
Running 20s test @ http://127.0.0.1:18081/large.html
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24s   150.78ms   1.59s    68.18%
    Req/Sec     5.85      5.79    29.00     83.67%
  Latency Distribution
     50%    1.19s 
     75%    1.29s 
     90%    1.43s 
     99%    1.59s 
  129 requests in 20.03s, 595.59MB read
  Socket errors: connect 0, read 0, write 0, timeout 107
Requests/sec:      6.44
Transfer/sec:     29.73MB